# IsValidHost Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
RebarHostData..::..IsValidHost Method
RebarHostData Class See Also
---
Reports whether the element is a valid rebar host.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValidHost()
```

Visual Basic
---
```text
Public Function IsValidHost As Boolean
```

Visual C++
---
```text
public:
bool IsValidHost()
```

# ### Return Value
True if the referenced Element can currently host Rebar elements, false otherwise.
# Remarks
If GetRebarHostData() returns a RebarHostData object, but RebarHostData.IsValidHost() returns false, this means that the element can be made a valid rebar host, generally by setting a property like FLOOR_PARAM_IS_STRUCTURAL or by changing the element's physical material to concrete. On the other hand, if GetRebarHostData() returns nullNothingnullptra null reference (Nothing in Visual Basic), the element cannot be made into a rebar host. This method replaces the Valid property from the 2011 Revit API.
# See Also
RebarHostData Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace